{
   "id": 113,
   "paso": -1,
   "tipo": "instruccionesiniciales",
   "instruccionesejercicio": [
      "Este ejercicio está relacionado con las interfaces en Java.",
      "Una interface se usa para definir un protocolo de comportamiento que puede ser implementado por cualquier clase de la jerarquía cuando:<ul><li>Se requiere un identificador comun para un parámetro de un método.</li><li>Deseas compilar tu código sin tener una implementación del objeto particular.</li><li>Se requiere especificar la firma exacta de los métodos que deben proveerse por todas las clases que implementen la interface.</li><li>Capturar similaridades entre clases no relacionadas.</li></ul>"
   ],
   "opciones": [
      {
         "paso": 0,
         "tipo": "pasoinicial",
         "instruccion": "Paso 1 de 3. Dado el siguiente fragmento de código, responde con Verdadero o Falso.<br>¿El código no compila porque el método jugar() debe definirse como abstracto en la interface Mascota?",
         "presentacion": [
            "interface Mascota {",
            "      void jugar();",
            "}",
            "abstract class Perro implements Mascota{ }"
         ],
         "textoEmocional": {
                "neutral": "Inicia con el ejercicio.",                
                "encantado": "Con esfuerzo y perseverancia podrás alcanzar tus metas.  ¡Inicia con el ejercicio!",
                "sorprendido": "Aprender es como remar contra corriente: en cuanto se deja, se retrocede. ¡Inicia con el ejercicio!",
                "compasivo": "Aprender sin reflexionar es malgastar la energía.  ¡Se que tu puedes!.  Empieza el ejercicio.",
                "esceptico": "¡Estudia! No para saber una cosa más, sino para saberla mejor.  Empieza el ejercicio.",
                "retroalimentacion": {
                    "positiva": "!Estoy orgulloso de ti!.",
                    "neutral": "Lo maravilloso de aprender algo, es que nadie puede arrebatárnoslo.",
                    "negativa": "Enseñar a quien no quiere aprender es como sembrar un campo sin ararlo."
                }
            },
         "opciones": [
            {
               "paso": 1,
               "texto": "Verdadero",
               "tipo": "pasoerroneo",
               "instruccion": "Respuesta incorrecta. Observa con atención el código e intenta de nuevo.",
               "presentacion": [
                  ""
               ],
               "textoEmocional": {
					 "neutral": "La respuesta es incorrecta. Inténtalo de nuevo.",
					"encantado": "¿Te has dado cuenta que cuando conoces bien un tema, te gusta?.  Sigue con el ejercicio.",
					"sorprendido": "Me sorprende tu deseo por aprender Java.  Sigue con el ejercicio.",
					"compasivo": "Aprender requiere de paciencia, intentalo de nuevo",
					"esceptico": "Trata de encontrar la respuesta correcta.",
					"retroalimentacion": {
						"positiva": "¡Casi, casi! pero la respuesta es incorrecta.",
						"neutral": "¡La respuesta es incorrecta!. Continúa con el ejercicio.",
						"negativa": "¡La respuesta es incorrecta!. Me parece que no te estás tomando en serio el ejercicio."
					}
				},
               "opciones": []
            },
            {
               "paso": 2,
               "texto": "Falso",
               "tipo": "pasooptimo",
               "instruccion": "Paso 2 de 3. Dado el siguiente fragmento de código, responde con Verdadero o Falso.  <br>¿El código no compila porque la clase Perro debe de implementar el método jugar de la interface Mascota?",
               "presentacion": [
                  "interface Mascota {",
                  "      void jugar();",
                  "}",
                  "abstract class Perro implements Mascota{}"
               ],
               "textoEmocional": {
					"neutral": "La respuesta es correcta. Continúa con el ejercicio.",
					"encantado": "Mas vale paso que dure y no trote que canse. Sigue con el ejercicio.",              
					"sorprendido": "No hay ascensor al éxito, tienes que tomar las escaleras. Sigue con el ejercicio.",
					"compasivo": "Cree y actúa como si fuese imposible fracasar. Sigue con el ejercicio.",                
					"esceptico": "Tus aspiraciones son tus posibilidades. Creo que tu escepticismo no te deja progresar.  Sigue con el ejercicio.",
					"retroalimentacion": {
						"positiva": "Revisa tu respuesta. ¡También de los errores se aprende!",
						"neutral": "La respuesta es correcta. Continúa con el ejercicio.",
						"negativa": "Me parece que sólo estás perdiendo el tiempo.  Sigue con el ejercicio."
					} 
				},
               "opciones": [
                  {
                     "paso": 3,
                     "texto": "Verdadero",
                     "tipo": "pasoerroneo",
                     "instruccion": "Respuesta incorrecta. La clase <i>Perro</i> es abstracta, por lo que puede contener métodos no implementados. Intenta de nuevo.",
                     "presentacion": [
                        ""
                     ],
                     "textoEmocional": {
                        "neutral": "La respuesta es incorrecta. Continúa con el ejercicio.",
                        "encantado": "La respuesta es incorrecta. Intenta encontrar la respuesta correcta.",              
                        "sorprendido": "La respuesta es incorrecta. Intenta encontrar la respuesta correcta.",
                        "compasivo": "Nuestra mayor debilidad reside en rendirnos. La forma más segura de tener éxito es intentarlo una vez más.",                
                        "esceptico": "Con un poco de motivación vas a encontrar la respuesta correcta.",
                        "retroalimentacion": {
                            "positiva": "¡Casi, casi! pero la respuesta es incorrecta.",
                            "neutral": "¡La respuesta es incorrecta!. Continúa con el ejercicio.",
                            "negativa": "¡La respuesta es incorrecta!. Me parece que no te estás tomando en serio el ejercicio."
                        } 
                    },
                     "opciones": []
                  },
                  {
                     "paso": 4,
                     "texto": "Falso",
                     "tipo": "pasooptimo",
                     "instruccion": "Paso 3 de 3.  Dado el siguiente fragmento de código, responde con Verdadero o Falso.  <br>¿El código no compila porque la declaración de la clase Perro debe de utilizar la palabra clave extends en vez de implements?",
                     "presentacion": [
                        "interface Mascota {",
                        "  void jugar();",
                        "}",
                        "abstract class Perro implements Mascota{ }"
                     ],
                     "textoEmocional": {
						"neutral": "!Correcto!.  Continúa con el ejercicio.",
						"encantado": "Cada logro comienza con la decisión de intentarlo, ¡sigue así!.",              
						"sorprendido": "¡Cosechas lo que siembras!, sigue adelante con el ejercicio.",
						"compasivo": "No hay ascensor al éxito, tienes que tomar las escaleras.  Sigue adelante con el ejercicio.",                
						"esceptico": "¿Todavía no crees que aprender Java sea importante?, al menos intenta terminar el ejercicio.",
						"retroalimentacion": {
							"positiva": "¡Correcto!.  El que persevera alcanza!.",
							"neutral": "El éxito consiste en ir de fracaso en fracaso sin pérdida de entusiasmo.",
							"negativa": "¿Ya te aburriste de encontrar las respuestas en forma aleatoria?"
						} 
					},
                     "opciones": [
                        {
                           "paso": 5,
                           "texto": "Verdadero",
                           "tipo": "pasoerroneo",
                           "instruccion": "Respuesta incorrecta. Observa con atención el código e intenta de nuevo.",
                           "presentacion": [
                              ""
                           ],
                           "textoEmocional": {
                                "neutral": "La respuesta es incorrecta.  Intenta de nuevo.",
                                "encantado": "Aun cuando la respuesta es incorrecta, se que estás intentando aprender Java.",
                                "sorprendido": "La respuesta no es correcta pero te siento con mucha decisión por aprender Java.",
                                "compasivo": "Qué no decaiga tu autoestima, aveces se requiere de tiempo para asimilar los conceptos de Java.",
                                "esceptico": "Se que pensabas que este ejercicio ejercicio era muy fácil para ti.",
                                "retroalimentacion": {                           
                                    "positiva": "La respuesta no es la correcta, ¡sigue intentandolo!",
                                    "neutral": "La respuesta no es la correcta",
                                    "negativa": "¿Estás seguro de querer estudiar este curso?."
                                }

                            },
                           "opciones": []
                        },
                        {
                           "paso": 6,
                           "texto": "Falso",
                           "tipo": "pasofinaloptimo",
                           "instruccion": "Respuesta incorrecta. Has finalizado el ejercicio, selecciona otro del menú de opciones.",
                           "presentacion": [
                              ""
                           ],
                           "textoEmocional": {
								"neutral": "Has finalizado con este ejercicio.",
								 "encantado": "El arte de vencer se aprende en las derrotas, ¡sigue con este entusiasmo!.",              
								 "sorprendido": "Somos lo que hacemos día a día. De modo que la excelencia no es un acto, sino un hábito.",
								 "compasivo": "No te des por vencido, ni aún vencido.  Cuando hay un problema, no hay nada que hacer; hay algo que saber.",                
								 "esceptico": "Muchos creen que el talento es cuestión de suerte, pero pocos saben que la suerte es cuestión de talento.",
								 "retroalimentacion": {
									   "positiva": "Para tener éxito, tus deseos de triunfar deberían ser más grandes que tu miedo de fracasar.",
									   "neutral": "Has finalizado con este ejercicio.",
									   "negativa": "El que no sabe lo que busca, no sabe lo que encuentra.  ¡Deja de jugar y ponte a estudiar!."
								} 
							},
                           "opciones": []
                        }
                     ]
                  }
               ]
            }
         ]
      }
   ]
}