{
    "id": 1,
    "paso":-1,
    "tipo":"instruccionesiniciales",
    "instruccionesejercicio": [
        "Este ejercicio evalúa un concepto básico sobre Java.",
        "Java fué diseñado por Sun Microsystems en la decáda de 1990. Moldeado en base a C++, el lenguaje Java se diseñó para ser pequeño, sencillo y portátil a través de plataformas y sistemas operativos."        
    ],
    "opciones": [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "Contesta la siguiente pregunta.",
            "presentacion": [
                "¿Java es un lenguaje de programación orientado a aspectos?"
            ],
            "textoEmocional": {
                "neutral": "Inicia el ejercicio",
                "encantado": "La confianza en tí mismo es el secreto del éxito.  Resuelve el ejercicio.",              
                "sorprendido": "Aprender Java es un gran reto.  Nada es demasiado difícil si se lo divide en pequeñas tareas.  Inicia con el ejercicio.",
                "compasivo": "Se que has sentido que no progresas con Java, pero recuerda: cualquiera que no esté cometiendo errores es que no está intentándolo lo suficiente.",                
                "esceptico": "¿Este ejercicio es fácil para ti?, selecciona otro ejercicio de mayor dificultad.",
                "retroalimentacion": {
                    "positiva": "¿Ya estás listo para resolver el ejercicio?, ¡inicia con mucho entusiamo!",
                    "neutral": "Resuelve el ejercicio",
                    "negativa": "Si no tomas en serio tus estudios, es díficil que  aprendas a programar en Java"
                }
            },
            "opciones": [
                {
                    "texto": "Verdadero",
                    "paso": 1,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  Intenta de nuevo.",
                    "presentacion": [
                        "¿Java es un lenguaje de programación orientado a aspectos?"
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es incorrecta.  Intenta de nuevo.",
                        "encantado": "Aun cuando la respuesta es incorrecta, se que estás intentando aprender Java.",
                        "sorprendido": "La respuesta no es correcta pero te siento con mucha decisión por aprender Java",
                        "compasivo": "Qué no decaiga tu autoestima, aveces se requiere de tiempo para asimilar los conceptos de Java",
                        "esceptico": "Se que pensabas que este ejercicio ejercicio era muy fácil para ti.",
                        "retroalimentacion": {                           
                            "positiva": "La respuesta no es la correcta, ¡sigue intentandolo!",
                            "neutral": "La respuesta no es la correcta",
                            "negativa": "La respuesta no es la correcta, ¿estás totalmente concentrado??"
                        }
                    },
                    "opciones": [
                    ]
                },
                {
                    "texto": "Falso",
                    "paso": 2,
                    "tipo": "pasofinaloptimo",
                    "instruccion": "La respuesta es correcta.  Selecciona otro ejercicio del menú de opciones.",
                    "presentacion": [
                        "Java es un lenguaje de programación de propósito general, concurrente, orientado a objetos."
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es correcta.",
                        "encantado": "Te siento emocionado, ya que resolviste este ejercicio.",
                        "sorprendido": "Siento que tu entusiasmo hace que el ejercio sea muy fácil de resolver.",
                        "compasivo": "Con un poco de paciencia vas a mejorar tu aprendizaje con Java, ¡ánimo!.",
                        "esceptico": "Se que este ejercicio es fácil para ti.  Intenta resolver otros ejercicios.",
                        "retroalimentacion": {                            
                            "positiva": "Muy bien!, estás en lo correcto, Java es un lenguaje de programación orientado a objetos",
                            "neutral": "La respuesta es correcta.  Selecciona otro ejercicio",
                            "negativa": "La respuesta es correcta, pero, ¿te lo estas tomando en serio?"                            
                        }
                    },
                    "opciones": [
                    ]
                }
            ]
        }
    ]
}