{
    "id": 78,
    "paso":-1,
    "tipo":"instruccionesiniciales",
    "instruccionesejercicio": [
        "Los métodos heredados de la clase base se pueden redefinir (también se le llama modificar o sobreescribir) en las clases derivadas.",
        "El método en la clase derivada se debe escribir con el mismo nombre, el mismo número y tipo de parámetros.  Si no fuera así estaríamos sobrecargando el método no redefiniéndolo."
    ],
    "opciones": [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "Paso 1 de 2.  ¿Cuál de los siguientes métodos se puede agregar en la clase Gato para redefinir el comportamiento del método comer?",
            "presentacion": [
                "public class Mascota {",
                "\tpublic void comer() {",
                "\t\tSystem.out.println( Mascota::comer() );",
                "\t}",
                "}",                
                "public class Gato extends Mascota {",
                "\t// sustituir método aquí",                
                "}"
            ],
            "textoEmocional": {
                "neutral": "Inicia con el ejercicio.",                
                "encantado": "Nada sobre esta tierra puede detener al hombre que posee la correcta actitud mental para lograr su meta. ¡Inicia con el ejercicio!",
                "sorprendido": "Aprender es como remar contra corriente: en cuanto se deja, se retrocede. ¡Comienza con el ejercicio!",
                "compasivo": "No hay nada en la vida que no contenga sus lecciones. Si estás vivo, siempre tendrás algo para aprender.  ¡Se que tu puedes!.  Empieza el ejercicio.",
                "esceptico": "Es posible que las lecciones te gusten o que te parezcan irrelevantes y tontas, pero no hay errores, sólo lecciones..  Comienza con el ejercicio.",
                "retroalimentacion": {
                    "positiva": "¡El mejor momento para aprender es ahora!. !Sigue así!.",
                    "neutral": "Cuando deseas algo, todo el universo conspira para que realices tu deseo.",
                    "negativa": "No deja de ser humillante para una persona de ingenio, saber que no hay tonto que no le pueda enseñar algo."
                }
            },
            "opciones": [
                {
                    "texto": "private void comer() {...}",
                    "paso": 1,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  El método sobreescrito puede tener un modificador de acceso menos restrictivo que el de la clase base.  Intentalo de nuevo.",
                    "presentacion": [
                        "public class Mascota {",
                        "\tpublic void comer() {",
                        "\t\tSystem.out.println( Mascota::comer() );",
                        "\t}",
                        "}",                        
                        "public class Gato extends Mascota {",
                        "\tprivate void comer() {...}",                
                        "}"
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                        "encantado": "Me parece que puedes hacerlo mejor, sigue intentándolo.",              
                        "sorprendido": "¡Me gusta tu actitud!, sigue así y estoy seguro que vas a encontrar la respuesta correcta.",
                        "compasivo": "La respuesta es incorrecta, ¡que no decaigan esos ánimos!.  Sigue adelante con el ejercicio.",                
                        "esceptico": "La respuesta es incorrecta.  También de las equivocaciones se puede aprender.",
                        "retroalimentacion": {
                            "positiva": "Me parece que puedes hacerlo mejor, sigue intentándolo.",
                            "neutral": "Para estudiar hay que tener perseverancia, paciencia y motivación.  ¡Sigue así!",
                            "negativa": "¡La respuesta es incorrecta!.  ¿Estás seguro de no estar adivinando?"
                        } 
                    },
                    "opciones": [                                                   
                    ]
                },
                {
                    "texto": "public static void comer() {...}",
                    "paso": 2,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  El método sobreescrito no puede ser de tipo static.  Intentalo de nuevo.",
                    "presentacion": [
                        "public class Mascota {",
                        "\tpublic void comer() {",
                        "\t\tSystem.out.println( Mascota::comer() );",
                        "\t}",
                        "}",                        
                        "public class Gato extends Mascota {",
                        "\tpublic static void comer() {...}",                
                        "}"
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                        "encantado": "Aun cuando la respuesta es incorrecta, se que estás intentando aprender Java.",              
                        "sorprendido": "La respuesta no es correcta pero te siento con mucha decisión por aprender Java.",
                        "compasivo": "La respuesta es incorrecta, ¡que no decaigan esos ánimos!.  Sigue adelante con el ejercicio.",                
                        "esceptico": "La respuesta es incorrecta.  También de las equivocaciones se puede aprender.",
                        "retroalimentacion": {
                            "positiva": "¡Intentalo una vez más!",
                            "neutral": "La respuesta es incorrecta.  Intenta de nuevo.",
                            "negativa": "Creo que no has estudiado lo suficiente."
                        } 
                    },
                    "opciones": [                                                   
                    ]
                },
                {
                    "texto": "public void comer( String n ) {...}",
                    "paso": 3,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  El método sobreescrito debe tener el mismo nombre, el mismo número y tipo de retorno.  Intentalo de nuevo.",
                    "presentacion": [
                        "public class Mascota {",
                        "\tpublic void comer() {",
                        "\t\tSystem.out.println( Mascota::comer() );",
                        "\t}",
                        "}",                        
                        "public class Gato extends Mascota {",
                        "\tpublic void comer( String n ) {...}",                
                        "}"
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                        "encantado": "La respuesta es incorrecta.  Intenta encontrar la respuesta correcta.",              
                        "sorprendido": "La respuesta es incorrecta.  Intenta encontrar la respuesta correcta.",
                        "compasivo": "La respuesta no es correcta pero te siento con mucha decisión por aprender Java.",                
                        "esceptico": "La respuesta es incorrecta.  Revisa tu respuesta.  Con un cambio en tu actitud vas a encontrar la respuesta correcta.",
                        "retroalimentacion": {
                            "positiva": "Estudiar Java demanda tiempo y esfuerzo pero al final siempre hay resultados positivos, ¡ánimo!.",
                            "neutral": "La forma más segura de tener éxito es intentarlo una vez más.",
                            "negativa": "Me parece que necesitas cambiar tu actitud."
                        } 
                    },
                    "opciones": [                                                   
                    ]
                },
                {
                    "texto": "public void comer() {...}",
                    "paso": 4,
                    "tipo": "pasofinaloptimo",
                    "instruccion": "Paso 2 de 2.  Fin del ejercicio.  ¡Fantástico!.  Selecciona otro ejercicio del menú.",
                    "presentacion": [
                        "public class Mascota {",
                        "\tpublic void comer() {",
                        "\t\tSystem.out.println( Mascota::comer() );",
                        "\t}",
                        "}",                        
                        "public class Gato extends Mascota {",
                        "\tpublic void comer() {...}",                
                        "}"
                    ],
                    "textoEmocional": {
                        "neutral": "Has finalizado con este ejercicio.",
                         "encantado": "El arte de vencer se aprende en las derrotas, ¡sigue con este entusiasmo!.",              
                         "sorprendido": "Somos lo que hacemos día a día. De modo que la excelencia no es un acto, sino un hábito.",
                         "compasivo": "No te des por vencido, ni aún vencido.  Cuando hay un problema, no hay nada que hacer; hay algo que saber.",                
                         "esceptico": "Muchos creen que el talento es cuestión de suerte, pero pocos saben que la suerte es cuestión de talento.",
                         "retroalimentacion": {
                               "positiva": "Para tener éxito, tus deseos de triunfar deberían ser más grandes que tu miedo de fracasar.",
                               "neutral": "Has finalizado con este ejercicio.",
                               "negativa": "El que no sabe lo que busca, no sabe lo que encuentra.  ¡Deja de jugar y ponte a estudiar!."
                        } 
                    },
                    "opciones": [                                                   
                    ]
                }
            ]
        }
    ]
}
