{
    "id": 40,
    "paso":-1,
    "tipo":"instruccionesiniciales",
    "instruccionesejercicio": [
        "El ciclo for es una versión simplificada del ciclo while.",
        "El ciclo for tiene tres partes: la variable de control, la condición de continuación del ciclo y el incremento de la variable de control."
    ],
    "opciones": [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "Dado el siguiente fragmento de programa en Java, ¿qué imprime en la consola de salida?",
            "presentacion": [
                "for( int i = 0; i < 3; i++ ){",
                "\tfor( int j = 0; j < i; j++ )",
                "\t\tSystem.out.print( i + \"\" + j );",
                "}"
            ],
            "textoEmocional": {
                "neutral": "Ahora te toca aprender: ciclo for.  Inicia con el ejercicio para continuar con el curso",
                "encantado": "El aprendizaje es un proceso de prueba y error: es una experimentación. Intenta resolver el ejercicio..  Inicia con el ejercicio para continuar con el curso.",              
                "sorprendido": "Tu actitud es la llave para abrir o cerrar el candado de la puerta del éxito.. inicia con el ejercicio.",
                "compasivo": "Cuando más oscuro está, es que está por amanecer.  Intenta resolver el ejercicio.",                
                "esceptico": "Se que estos ejercicios están muy facilitos, pero cubren conceptos básicos que se necesitan en los cursos avanzados.",
                "retroalimentacion": {
                    "positiva": "El éxito consiste en ir de fracaso en fracaso sin pérdida de entusiasmo.",
                    "neutral": "Cree en ti mismo y en lo que eres.",
                    "negativa": "Aprendes a hablar hablando, a programar programando.  Con esta actitud me parece dificil que aprendas Java."
                } 
            },
            "opciones": [
                {
                    "texto": "102021",
                    "paso": 1,
                    "tipo": "pasofinaloptimo",
                    "instruccion": "La respuesta es correcta.  Selecciona otro ejercicio del menú de opciones.",
                    "presentacion": [
                        "for( int i = 0; i < 3; i++ ){",
                        "\tfor( int j = 0; j < i; j++ )",
                        "\t\tSystem.out.print( i + \"\" + j );",
                        "}"
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es correcta.  Haz finalizado con el ejercicio.",
                        "encantado": "Con esfuerzo y perseverancia podrás alcanzar tus metas. Haz terminado este ejercicio.",              
                        "sorprendido": "Me sorprende como vas progresando.  Haz terminado con el ejercicio.",
                        "compasivo": "No hay mal que por bien no venga.  Haz finalizado con el ejercicio.",                
                        "esceptico": "Se que estos ejercicios no son un reto para ti.  Al menos ya terminaste este ejercicio.",
                        "retroalimentacion": {
                            "positiva": "¡La respuesta es correcta!.  Sigue con el siguiente ejercicio.",
                            "neutral": "La respuesta es correcta.  Continúa con el siguiente ejercicio.",
                            "negativa": "Nunca consideres el estudio una obligación.  Resuelve el siguiente ejercicio."
                        } 
                    },
                    "opciones": [
                    ]
                },
                {
                    "texto": "101122",
                    "paso": 2,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  Intenta de nuevo.",
                    "presentacion": [
                        "for( int i = 0; i < 3; i++ ){",
                        "\tfor( int j = 0; j < i; j++ )",
                        "\t\tSystem.out.print( i + \"\" + j );",
                        "}"
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                        "encantado": "La respuesta es incorrecta pero con un poco de esfuerzo encontrarás la respuesta correcta.",              
                        "sorprendido": "La respuesta es incorrecta.  Sigue adelante con el ejercicio.",
                        "compasivo": "La respuesta es incorrecta, ¡que no decaigan esos ánimos!.  Sigue adelante con el ejercicio.",                
                        "esceptico": "La respuesta es incorrecta. Continúa con el ejercicio.",
                        "retroalimentacion": {
                            "positiva": "¡Casi, casi! pero la respuesta es incorrecta.",
                            "neutral": "¡La respuesta es incorrecta!.  Continúa con el ejercicio.",
                            "negativa": "¡La respuesta es incorrecta!.  Me parece que no te estás tomando en serio el ejercicio."
                        } 
                    },
                    "opciones": [
                    ]
                }                
            ]
        }
    ]
}