{
    "id":19,
    "paso":-1,
    "instruccionesejercicio": 
    [
        "Las variables son una de las características fundamentales de los lenguajes de programación, permiten acceder a la memoria para almacenar y recuperar los datos con los que nuestros programas van a trabajar. Son por tanto el mecanismo que los lenguajes de programación ponen a nuestra disposición para acceder a la memoria.",
        "Java es un lenguaje tipado y nos obliga a declarar nuestras variables antes de poder hacer uso de ellas, con esta declaración le indicamos al compilador el espacio en memoria que debe de reservar para almacenar la información. "
    ],
    "opciones": 
    [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "¿Cual es el resultado que se obtiene al compilar y ejecutar el siguiente código?",
            "presentacion": 
            [
                "public class Test {",
                "\tpublic static void main( String args[ ] ){",
                "\t\tfloat f = 1/2;",
                "\t\tSystem.out.println( f );",
                "\t}",
                "}"
            ],
            "textoEmocional": {
                "neutral": "Inicia el ejercicio.",
                "encantado": "Inicia con el ejercicio. ¡Conserva siempre esas ganas y deseos de superación! ",              
                "sorprendido": "Me sorprende tu actitud, aprender Java es un gran reto pero se que lo vas a lograr.  Inicia con el ejercicio.",
                "compasivo": "Aprender Java parece complicado, pero tienes que intentarlo. Inicia con el ejercicio.",                
                "esceptico": "¿Este ejercicio es fácil para ti?, selecciona otro ejercicio de mayor dificultad.",
                "retroalimentacion": {
                    "positiva": "¡Adelante!, con este ejercicio vas a aprender a crear un programa simple en Java.",
                    "neutral": "Inicia con el ejercicio para aprender a crear un programa simple en Java.",
                    "negativa": "El éxito empieza cuando tu quieres.  Con esta actitud me parece dificil que llegues muy lejos con Java"
                } 
            },
            "opciones": 
            [
                {
                    "texto": "0.0",
                    "paso": 1,
                    "tipo": "pasofinaloptimo",
                    "instruccion": "La respuesta es correcta.  Selecciona otro ejercicio del menú de opciones.",
                    "presentacion": 
                    [
                        "public class Test {",
                        "\tpublic static void main( String args[ ] ){",
                        "\t\tfloat f = 1/2;",
                        "\t\tSystem.out.println( f );",
                        "\t}",
                        "}"
                    ],
                    "textoEmocional": {
                        "neutral": "Has finalizado con este ejercicio.",
                        "encantado": "Cada logro comienza con la decisión de intentarlo.”, ¡sigue con este entusiasmo!.",              
                        "sorprendido": "Cada logro comienza con la decisión de intentarlo, por lo pronto has finalizado con este ejercicio..",
                        "compasivo": "¿Todavía crees que aprender Java es complicado?.  Por lo pronto has finalizado con este ejercicio..",                
                        "esceptico": "Al menos llegaste al final del ejercicio.",
                        "retroalimentacion": {
                            "positiva": "¡Felicidades!.  Has finalizado con este ejercicio.",
                            "neutral": "Has finalizado con este ejercicio.",
                            "negativa": "Has finalizado con este ejercicio."
                        } 
                    },
                    "opciones": []
                },
                {
                    "texto": "0.5",
                    "paso": 2,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  Intenta de nuevo.",
                    "presentacion": 
                    [
                        "public class Test {",
                        "\tpublic static void main( String args[ ] ){",
                        "\t\tfloat f = 1/2;",
                        "\t\tSystem.out.println( f );",
                        "\t}",
                        "}"
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                        "encantado": "La respuesta es incorrecta pero con un poco de esfuerzo encontrarás la respuesta correcta.",              
                        "sorprendido": "La respuesta es incorrecta.  Sigue adelante con el ejercicio.",
                        "compasivo": "La respuesta es incorrecta, ¡que no decaigan esos ánimos!.  Sigue adelante con el ejercicio.",                
                        "esceptico": "Se que estos ejercicios no son un reto para ti, pero cubren conceptos básicos que se necesitan en los cursos avanzados.",
                        "retroalimentacion": {
                            "positiva": "¡La respuesta  es incorrecta!.  Continúa con el ejercicio.",
                            "neutral": "¡La respuesta  es incorrecta!.  Continúa con el ejercicio.",
                            "negativa": "¡La respuesta es incorrecta!.  Me parece que no te estás tomando en serio el ejercicio."
                } 
},
                    "opciones": []
                }
            ]
        }
    ] 
}