{
    "id":30,
    "paso":-1,
    "instruccionesejercicio": 
    [
        "Los operadores && y || se llaman operadores en cortocircuito porque si no se cumple la condición de un término no se evalúa el resto de la operación. Por ejemplo: (a == b && c != d && h >= k) tiene tres evaluaciones: la primera comprueba si la variable a es igual a b. Si no se cumple esta condición, el resultado de la expresión es falso y no se evalúan las otras dos condiciones posteriores."
    ],
    "opciones": 
    [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "Selecciona la opción que responda a la pregunta.",
            "presentacion": 
            [
                "Señala los operadores que se evalúan en corto circuito (&&,||), (&,|):"
            ],
            "textoEmocional": {
                 "neutral": "Inicia con el ejercicio para continuar con el tema: instrucción if.",
                "encantado": "Me gusta tu actitud.  Inicia con el ejercicio para continuar con el tema: instrucción if.",              
                "sorprendido": "¡Me sorprendes!.   Inicia con el ejercicio para continuar con el tema: instrucción if.",
                "compasivo": "No esperes que pase la tormenta, aprende a bailar bajo la lluvia.  Intenta resolver el ejercicio (instrucción if).",                
                "esceptico": "Deberías considerar modificar tu escepticismo.  Inicia con el ejercicio (instrucción if).",
                "retroalimentacion": {
                    "positiva": "Haz lo necesario para lograr tu más ardiente deseo, y acabarás lográndolo",
                    "neutral": "Resuelve el ejercicio para continuar con el tema: instrucción if",
                    "negativa": "Se alcanza el éxito convirtiendo cada paso en una meta y cada meta en un paso.  ¡Cambia tu actitud!"
                } 
            },
            "opciones": 
            [
                {
                    "texto": "& , |",
                    "paso": 1,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  Intenta de nuevo.",
                    "presentacion": 
                    [
                         "Señala los operadores que se evalúan en corto circuito (&&,||), (&,|):"
                    ],
                    "textoEmocional":
                    {
                        "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                        "encantado": "La respuesta es incorrecta pero con un poco de esfuerzo encontrarás la respuesta correcta.",              
                        "sorprendido": "La respuesta es incorrecta.  Sigue adelante con el ejercicio.",
                        "compasivo": "La respuesta es incorrecta, ¡que no decaigan esos ánimos!.  Sigue adelante con el ejercicio.",                
                        "esceptico": "La respuesta es incorrecta. Continúa con el ejercicio.",
                        "retroalimentacion": {
                            "positiva": "¡Casi, casi! pero la respuesta es incorrecta.",
                            "neutral": "¡La respuesta es incorrecta!.  Continúa con el ejercicio.",
                            "negativa": "¡La respuesta es incorrecta!.  Me parece que no te estás tomando en serio el ejercicio."
                        } 
                    },
                    "opciones": []
                },
                {
                    "texto": "&& , ||",
                    "paso": 2,
                    "tipo": "pasofinaloptimo",
                    "instruccion": "La respuesta es correcta.",
                    "presentacion": 
                    [
                        "&& y || se evalúan en corto circuito."
                    ],
                    "textoEmocional": {
                         "neutral": "Has finalizado con este ejercicio.",
                         "encantado": "Estudiar con esfuerzo y positivismo trae consigo siempre buenas recompensas.”, ¡sigue con este entusiasmo!.",              
                         "sorprendido": "El que persevera alcanza!, ¡sigue con este entusiasmo!.",
                         "compasivo": "¿Todavía crees que aprender Java es complicado?.  Establece objetivos a corto plazo y pronto serás un Sensei de Java.",                
                         "esceptico": "Al menos llegaste al final del ejercicio.",
                         "retroalimentacion": {
                               "positiva": "¡Felicidades!.",
                               "neutral": "Has finalizado con este ejercicio.",
                               "negativa": "Me parece que sólo estabas adivinando las respuestas."
                        } 
                    },
                    "opciones": []
                }                
            ]
        }
    ] 
}