{
    "id":21,
    "paso":-1,
    "instruccionesejercicio": 
    [
        "Las instrucciones de selección utilizan condiciones.  Las condiciones son expresiones booleanas.",
        "El resultado de evaluar una condición es un valor booleano true o false."
    ],
    "opciones": 
    [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "Selecciona la opción que responda a la pregunta.",
            "presentacion": 
            [
                "¿La condición de una instrucción if debe ser una expresión de tipo boolean?"
            ],
            "textoEmocional": {
                 "neutral": "Inicia con el ejercicio para continuar con el tema: instrucción if.",
                "encantado": "No es lo que tu tienes, sino como usas lo que tienes lo que marca la diferencia.  Inicia con el ejercicio para continuar con el tema: instrucción if.",              
                "sorprendido": "¡Me sorprendes!.   Inicia con el ejercicio para continuar con el tema: instrucción if.",
                "compasivo": "La perseverancia es fallar 19 veces y tener éxito la vigésima.  Intenta resolver el ejercicio (instrucción if).",                
                "esceptico": "Deberías considerar modificar tu escepticismo.  Inicia con el ejercicio (instrucción if).",
                "retroalimentacion": {
                    "positiva": "Noto que cada día eres mejor.  ¿Ya estás preparado para aprender algo nuevo?",
                    "neutral": "Resuelve el ejercicio para continuar con el tema: instrucción if",
                    "negativa": "Aquellos que dicen que algo no puede hacerse, suelen ser interrumpidos por otros que lo están haciendo."
                } 
            },
            "opciones": 
            [
                {
                    "texto": "Verdadero",
                    "paso": 1,
                    "tipo": "pasofinaloptimo",
                    "instruccion": "La respuesta es correcta.",
                    "presentacion": 
                    [
                        "La condición en una instrucción if debe ser de tipo boolean."
                    ],
                    "textoEmocional": {
						"neutral": "Has finalizado con este ejercicio.",
						"encantado": "Cada logro comienza con la decisión de intentarlo.”, ¡sigue con este entusiasmo!.",              
						"sorprendido": "Cada logro comienza con la decisión de intentarlo, por lo pronto has finalizado con este ejercicio.",
						"compasivo": "¿Todavía crees que aprender Java es complicado?.  Por lo pronto has finalizado con este ejercicio.",                
						"esceptico": "Al menos llegaste al final del ejercicio.  Sigue aprendiendo Java.",
						"retroalimentacion": {
							"positiva": "Con esfuerzo y perseverancia podrás alcanzar tus metas.  ¡Sigue así!",
							"neutral": "Has finalizado con este ejercicio.",
							"negativa": "Aprender sin reflexionar es malgastar la energía.  ¡Necesitas mejorar!"
						}		 
					},
                    "opciones": []
                },
                {
                    "texto": "Falso",
                    "paso": 2,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  Intenta de nuevo.",
                    "presentacion": 
                    [
                         "¿La condición de una instrucción if debe ser una expresión de tipo boolean?"
                    ],
                    "textoEmocional":
                    {
                        "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                        "encantado": "La respuesta es incorrecta pero con un poco de esfuerzo encontrarás la respuesta correcta.",              
                        "sorprendido": "La respuesta es incorrecta.  Sigue adelante con el ejercicio.",
                        "compasivo": "La respuesta es incorrecta, ¡que no decaigan esos ánimos!.  Sigue adelante con el ejercicio.",                
                        "esceptico": "La respuesta es incorrecta. Continúa con el ejercicio.",
                        "retroalimentacion": {
                            "positiva": "¡Casi, casi! pero la respuesta es incorrecta.",
                            "neutral": "¡La respuesta es incorrecta!.  Continúa con el ejercicio.",
                            "negativa": "¡La respuesta es incorrecta!.  Me parece que no te estás tomando en serio el ejercicio."
                        } 
                    },
                    "opciones": []
                }
            ]
        }
    ] 
}