{
    "id": 66,
    "paso":-1,
    "tipo":"instruccionesiniciales",
    "instruccionesejercicio": [
		"Este ejercicio esta relacionado con la declaración de un arreglo.",
		"Al igual que los demás objetos, los arreglos se crean con la palabra clave new. Para crear un objeto arreglo, debemos especificar el tipo de cada elemento y el número de elementos que se requieren para el arreglo, como parte de una expresión para crear un arreglo que utiliza la palabra clave new."
	],
    "opciones": [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "Selecciona verdadero o falso. La siguiente instrucción corresponde a una declaración y creación de un arreglo de tipo carácter de 12 elementos.",
            "presentacion": [			
				"String [ ] arreglo1 = new String [12];"

            ],
            "textoEmocional": {
                "neutral": "Inicia el ejercicio.",
                "encantado": "Inicia con el ejercicio. ¡Conserva siempre esas ganas y deseos de superación! ",              
                "sorprendido": "Me sorprende tu actitud, aprender Java es un gran reto pero se que lo vas a lograr.  Inicia con el ejercicio.",
                "compasivo": "Aprender Java parece complicado, pero tienes que intentarlo. Inicia con el ejercicio.",                
                "esceptico": "¿Este ejercicio es fácil para ti?, selecciona otro ejercicio de mayor dificultad.",
                "retroalimentacion": {
                    "positiva": "¡Adelante!, con este ejercicio vas a aprender sobre la utilización de arreglos en Java.",
                    "neutral": "Inicia con el ejercicio para aprender sobre la utilización de arreglos en Java",
                    "negativa": "El éxito empieza cuando tu quieres.  Con esta actitud me parece dificil que llegues muy lejos con Java"
                } 
            },
            "opciones": [
{
						"texto": "Verdadero",
						"paso": 1,
						"tipo": "pasoerroneo",
						 "instruccion": "La respuesta es incorrecta. La instrucción corresponde a una declaración y creación de un arreglo de tipo String de 12 elementos.",
						"presentacion": [
											
						],
						"textoEmocional": {
							"neutral": "La respuesta es incorrecta.  Intenta de nuevo.",
							"encantado": "Aun cuando la respuesta es incorrecta, intenta encontrar la respuesta.",
							"sorprendido": "La respuesta no es correcta pero te siento con mucha decisión.  Encuentra la respuesta",
							"compasivo": "Qué no decaiga tu autoestima, aveces se requiere de tiempo para asimilar los conceptos de Java",
							"esceptico": "Se que pensabas que este ejercicio ejercicio era muy fácil para ti.",
							"retroalimentacion": {                           
								"positiva": "La respuesta no es la correcta, ¡sigue intentándolo!",
								"neutral": "La respuesta no es la correcta.",
								"negativa": "¿Estás seguro de querer estudiar este curso?."
							}
						},
						"opciones": [
						]
					},	
					{
						"texto": "Falso",
						"paso": 2,
						"tipo": "pasofinaloptimo",
						"instruccion": "Respuesta correcta. Selecciona un nuevo ejercicio del menú de opciones.",
						"presentacion": [
							
						],
						"textoEmocional": {
							"neutral": "La respuesta es correcta. Has finalizado el ejercicio.",
							"encantado": "Siento que tu entusiasmo hace que el ejercicio sea muy fácil de resolver",
							"sorprendido": "¡Me sorprendes!, continúa así.",
							"compasivo": "Con un poco de paciencia vas a mejorar tu aprendizaje con Java, ¡ánimo!.",
							"esceptico": "Se que este ejercicio es fácil para ti.  Trata de terminar el ejercicio.",
							"retroalimentacion": {                            
								"positiva": "¡Excelente!, la respuesta es correcta.  Continúa con otro ejercicio del menú.",
								"neutral": "La respuesta es correcta.  Continúa con otro ejercicio del menú.",
								"negativa": "La respuesta es correcta, pero aprender Java requiere que te tomes las cosas en serio."                            
							}
						},
						"opciones": [  
							
						]
					}				
			]
        }
    ]
        
 
}