{
    "id":51,
    "paso":-1,
    "instruccionesejercicio": 
    [
        "Concepto: Crear y declarar un arreglo unidimensional.",
        "Con este ejercicio aprenderás a crear y declarar un arreglo unidimensional.  En Java, un arreglo es un grupo de variables (llamadas elementos o componentes) que contienen valores, todos del mismo tipo.  Para declarar un arreglo unidimensional debes especificar el tipo de cada elemento y el número de elementos que se requieren par el arreglo.  Para crear un arreglo se utiliza la palabra clave new."
    ],
    "opciones": 
    [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "Paso 1 de 3.  Selecciona la opción que declara un arreglo de tipo int.",
            "presentacion": 
            [
                "public class JavaSensei {",
                "\tpublic static void main( String[] args ) {",
                "\t\t<input type='text' readonly class='focusInput'>",
                "\t}",
                "}"
            ],
            "textoEmocional": {
                "neutral": "Inicia el ejercicio para continuar con el curso.",
                "encantado": "Sólo si te permites el lujo de soñar, tus sueños podrán convertirse algún día en una realidad.  Comienza con el ejercicio.",              
                "sorprendido": "Intenta y falla, pero nunca falles en intentarlo.  Comienza con el ejercicio.",
                "compasivo": "Si quieres que las cosas cambien no tengas siempre la misma respuesta para los mismos problemas.  Comienza con el ejercicio.",                
                "esceptico": "Siempre recuerda que tu enfoque es el que determina tu realidad. Comienza con el ejercicio.",
                "retroalimentacion": {
                    "positiva": "Tus acciones positivas combinadas con pensamientos positivos resultan en el éxito",
                    "neutral": "Concentra tus esfuerzos en el presente, olvídate del pasado y no pierdas el tiempo en el futuro.",
                    "negativa": "Las personas apáticas no se mueven, solo se sientan y esperan a que las cosas mejoren."
                }  
            },
            "opciones": 
            [
                {
                    "texto": "Verdadero",
                    "paso": 1,
                    "tipo": "pasofinaloptimo",
                    "instruccion": "La respuesta es correcta.",
                    "presentacion": 
                    [
                        "Todos los elementos en un arreglo deben ser del mismo tipo."
                    ],
                    "textoEmocional": {
                        "neutral": "La respuesta es correcta.",
                        "encantado": "Siento que tu entusiasmo hace que el ejercicio sea muy fácil de resolver",
                        "sorprendido": "¡Me sorprendes!, continúa así.",
                        "compasivo": "Con un poco de paciencia vas a mejorar tu aprendizaje con Java, ¡ánimo!.",
                        "esceptico": "Se que este ejercicio es fácil para ti.  Trata de terminar el ejercicio.",
                        "retroalimentacion": {                            
                            "positiva": "Muy bien!, estás en lo correcto.  Continúa con el ejercicio.",
                            "neutral": "La respuesta es correcta.  Continúa con el ejercicio.",
                            "negativa": "La respuesta es correcta, pero, ¿te lo estas tomando en serio?"                            
                        }
                    },
                    "opciones": []
                },
                {
                    "texto": "Falso",
                    "paso": 2,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  Intenta de nuevo.",
                    "presentacion": 
                    [
                         "¿Todos los elementos en un arreglo deben ser del mismo tipo?"
                    ],
                     "textoEmocional": {
                        "neutral": "La respuesta es incorrecta.  Intenta de nuevo.",
                        "encantado": "Aun cuando la respuesta es incorrecta, se que estás intentando aprender Java.",
                        "sorprendido": "La respuesta no es correcta pero te siento con mucha decisión por aprender Java",
                        "compasivo": "Qué no decaiga tu autoestima, aveces se requiere de tiempo para asimilar los conceptos de Java",
                        "esceptico": "Se que pensabas que este ejercicio ejercicio era muy fácil para ti.",
                        "retroalimentacion": {                           
                            "positiva": "La respuesta no es la correcta, ¡sigue intentandolo!",
                            "neutral": "La respuesta no es la correcta",
                            "negativa": "¿Estás seguro de querer estudiar este curso?."
                        }
                    },
                    "opciones": []
                }
            ]
        }
    ] 
}