{
    "id": 39,
    "paso":-1,
    "tipo":"instruccionesiniciales",
    "instruccionesejercicio": [
        "El ciclo while permite ejecutar una secuencia de instrucciones mientras la condición sea verdadera.",
        "El cuerpo del ciclo contiene las instrucciones que se van a ejecutar una o más veces dependiendo de si se cumple o no la condición del ciclo."

    ],
    "opciones": [
        {
            "paso": 0,
            "tipo": "pasoinicial",
            "instruccion": "Dado el siguiente fragmento de programa en Java, ¿Cuántas veces se ejecutará el ciclo while?",
            "presentacion": [
                "int x = 1;",
                "while ( x < 20 ) {",
                "\tx = x + 2;",
                "\tSystem.out.println( x );",
                "}" 
            ],
            "textoEmocional": {
                "neutral": "Inicia los ejercicios",
                "encantado": "El primer secreto del éxito es la autoconfianza. Sigue resolviendo los ejercicios",
                "sorprendido": "!Me sorprende tu compromiso y actitud!, inicia con el ejercicio",
                "compasivo": "¡Sigue hacia adelante, inténtandolo, pronto vas a mejorar, realiza el ejercicio",
                "esceptico": "Piensa si quieres iniciar este ejercicio, tal vez quieras buscar otros ejercicios",
                "retroalimentacion": {
                    "positiva": "¡Sigue estudiando y resolviendo los ejercicios con ese entusiasmo de siempre!",
                    "neutral": "Resuelve el ejercicio",
                    "negativa": "¿Ya estás listo para resolver el ejercicio?, ¡necesitas concentrarte!"
                }
            },
            "opciones": [                
                {
                    "texto": "9",
                    "paso": 1,
                    "tipo": "pasoerroneo",
                    "instruccion": "La respuesta es incorrecta.  Intenta de nuevo.",
                    "presentacion": [
                        "int x = 1;",
                        "while ( x < 20 ) {",
                        "\tx = x + 2;",
                        "\tSystem.out.println( x );",
                        "}" 
                    ],
                    "textoEmocional": {
                         "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                        "encantado": "La respuesta es incorrecta.  Intenta encontrar la respuesta correcta.",              
                        "sorprendido": "La respuesta es incorrecta.  Intenta encontrar la respuesta correcta.",
                        "compasivo": "La respuesta es correcta.  La forma más segura de tener éxito es intentarlo una vez más.",                
                        "esceptico": "¿Te equivocaste de nuevo?, con un cambio en tu actitud vas a encontrar la respuesta correcta.",
                        "retroalimentacion": {
                            "positiva": "La respuesta es incorrecta.  Revisa tu respuesta.",
                            "neutral": "La respuesta es incorrecta.  Continúa con el ejercicio.",
                            "negativa": "Me parece que necesitas cambiar tu actitud."
                        } 
                    },
                    "opciones": [
                    ]
                },
                {
                    "texto": "10",
                    "paso": 2,
                    "tipo": "pasofinaloptimo",
                    "instruccion": "La respuesta es correcta.  Selecciona otro ejercicio del menú de opciones.",
                    "presentacion": [
                        "int x = 1;",
                        "while ( x < 20 ) {",
                        "\tx = x + 2;",
                        "\tSystem.out.println( x );",
                        "}" 
                    ],
                    "textoEmocional": {
                        "neutral": "Has finalizado con este ejercicio.",
                        "encantado": "Cada logro comienza con la decisión de intentarlo.”, ¡sigue con este entusiasmo!.",              
                        "sorprendido": "Cada logro comienza con la decisión de intentarlo, por lo pronto has finalizado con este ejercicio..",
                        "compasivo": "¿Todavía crees que aprender Java es complicado?.  Por lo pronto has finalizado con este ejercicio..",                
                        "esceptico": "Al menos llegaste al final del ejercicio.",
                        "retroalimentacion": {
                            "positiva": "¡Felicidades!.  Has finalizado con este ejercicio.",
                            "neutral": "Has finalizado con este ejercicio.",
                            "negativa": "Has finalizado con este ejercicio."
                        } 
                    },
                    "opciones": [
                    ]
                }                
            ]
        }
    ]
}